package com.qc.test

object b_数据类型 {

  def main(args:Array[String]):Unit = {

    /*
      首先数据类型都是大写字母开头
      数据类型相对于常规比较不常见的几个：
      ===================================================================================
      Byte：8位有符号补码整数。数值区间为 -128 到 127
      Unit：表示无值，和其他语言中void等同。用作不返回任何结果的方法的结果类型。Unit只有一个实例值，写成()。
      Nothing：Nothing类型在Scala的类层级的最底端；它是任何其他类型的子类型。
      AnyRef：AnyRef类是Scala里所有引用类(reference class)的基类
      ===================================================================================
      备注：引用就是一个对象的别名，指针指向是一个
      eg:
      String a="This is a Text!";
      String b=a;··
      ====================================================================================

      另外浮点型字面量以f结尾的就是Float类型,其它就是Double类型

      ====================================================================================
      多行字符串的字面量标识竟然和python有点类似竟然是三个双引号
      ====================================================================================

     */



  }

}
